[
  "cmdr",
  "obsidian-style-settings",
  "obsidian-outliner",
  "obsidian-linter",
  "fuzzy-chinese-pinyin",
  "code-styler",
  "obsidian-git",
  "show-hidden-files",
  "vscode-editor",
  "easy-typing-obsidian",
  "hotkeysplus-obsidian",
  "any-block",
  "url-into-selection",
  "embed-code-file",
  "obsidian-kanban"
]