[
  "cmdr",
  "obsidian-style-settings",
  "obsidian-outliner",
  "obsidian-linter",
  "fuzzy-chinese-pinyin",
  "code-styler",
  "embed-code-file",
  "obsidian-git",
  "show-hidden-files",
  "obsidian42-brat",
  "vscode-editor"
]