tap "daipeihust/tap"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/services"
tap "laishulu/macism"
tap "macos-fuse-t/cask"
tap "modularml/packages"
tap "yakitrak/yakitrak"
brew "gettext"
brew "glib"
brew "cairo"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "bash"
brew "bat"
brew "broot"
brew "coreutils"
brew "libidn2"
brew "curl"
brew "duf"
brew "dust"
brew "exa"
brew "fd"
brew "unbound"
brew "gnutls"
brew "libass"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fselect"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "libgpg-error"
brew "gnupg"
brew "gradle"
brew "gtk+3"
brew "helix"
brew "homebank"
brew "node"
brew "iconsur"
brew "imagemagick"
brew "jq"
brew "libslirp"
brew "libzip"
brew "lua"
brew "mackup"
brew "maclaunch"
brew "navi"
brew "neovim"
brew "nushell"
brew "openjdk"
brew "openssl@1.1"
brew "pandoc"
brew "pinentry-mac"
brew "pipx"
brew "python@3.11"
brew "qemu"
brew "redis"
brew "ripgrep"
brew "rsync"
brew "scrcpy"
brew "showkey"
brew "sleepwatcher", restart_service: true
brew "smartmontools"
brew "starship"
brew "tldr"
brew "tmux"
brew "trash"
brew "wget"
brew "xsv"
brew "zellij"
brew "zoxide"
brew "daipeihust/tap/im-select"
brew "laishulu/macism/macism"
brew "modularml/packages/modular"
brew "yakitrak/yakitrak/obs"
cask "android-platform-tools"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-lxgw-wenkai"
cask "fuse-t"
cask "macfuse"
cask "mounty"
cask "sf-symbols"
vscode "13xforever.language-x86-64-assembly"
vscode "64kramsystem.markdown-code-blocks-asm-syntax-highlighting"
vscode "adpyke.codesnap"
vscode "akamud.vscode-theme-onelight"
vscode "alefragnani.project-manager"
vscode "asvetliakov.vscode-neovim"
vscode "beishanyufu.ime-and-cursor"
vscode "bhughes339.replacerules"
vscode "bierner.markdown-mermaid"
vscode "chrmarti.regex"
vscode "codeium.codeium"
vscode "csholmq.excel-to-markdown-table"
vscode "cweijan.vscode-office"
vscode "dakara.transformer"
vscode "dan-c-underwood.arm"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "draivin.hscopes"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "foam.foam-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "gera2ld.markmap-vscode"
vscode "github.remotehub"
vscode "hoovercj.vscode-settings-cycler"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "idleberg.applescript"
vscode "jsynowiec.vscode-insertdatestring"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "leetcode.vscode-leetcode"
vscode "lencerf.beancount"
vscode "marp-team.marp-vscode"
vscode "mattn.lisp"
vscode "mdickin.markdown-shortcuts"
vscode "mechatroner.rainbow-csv"
vscode "misodee.vscode-nbt"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "mushan.vscode-paste-image"
vscode "naumovs.color-highlight"
vscode "orangex4.vscode-smart-ime"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "remisa.shellman"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.text-marker"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "sdras.night-owl"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "tabnine.tabnine-vscode"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tootone.org-mode"
vscode "usernamehw.todo-md"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wallabyjs.quokka-vscode"
vscode "wesbos.theme-cobalt2"
vscode "xabikos.javascriptsnippets"
vscode "xadillax.viml"
vscode "yzhang.markdown-all-in-one"
vscode "zaaack.markdown-editor"
vscode "zixuanwang.linkerscript"
