tap "espanso/espanso"
tap "homebrew/bundle"
tap "macos-fuse-t/cask"
brew "bat"
brew "coreutils"
brew "curl"
brew "duf"
brew "dust"
brew "duti"
brew "eza"
brew "fd"
brew "findutils"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "lsd"
brew "moreutils"
brew "node"
brew "pipx"
brew "ripgrep"
brew "rsync"
brew "sleepwatcher"
brew "tealdeer"
brew "tmux"
brew "trash"
brew "vim"
brew "wget"
brew "zoxide"
cask "android-platform-tools"
cask "espanso"
cask "font-hack-nerd-font"
cask "fuse-t"
cask "fuse-t-sshfs"
cask "kopiaui"
cask "librewolf"
cask "visual-studio-code"
vscode "13xforever.language-x86-64-assembly"
vscode "64kramsystem.markdown-code-blocks-asm-syntax-highlighting"
vscode "adpyke.codesnap"
vscode "akamud.vscode-theme-onelight"
vscode "alefragnani.project-manager"
vscode "asvetliakov.vscode-neovim"
vscode "beishanyufu.ime-and-cursor"
vscode "bhughes339.replacerules"
vscode "bierner.markdown-mermaid"
vscode "chrmarti.regex"
vscode "codeium.codeium"
vscode "csholmq.excel-to-markdown-table"
vscode "cweijan.vscode-office"
vscode "dakara.transformer"
vscode "dan-c-underwood.arm"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "draivin.hscopes"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "foam.foam-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "gera2ld.markmap-vscode"
vscode "github.remotehub"
vscode "hoovercj.vscode-settings-cycler"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "idleberg.applescript"
vscode "jsynowiec.vscode-insertdatestring"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "leetcode.vscode-leetcode"
vscode "lencerf.beancount"
vscode "marp-team.marp-vscode"
vscode "mattn.lisp"
vscode "mdickin.markdown-shortcuts"
vscode "mechatroner.rainbow-csv"
vscode "misodee.vscode-nbt"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "mushan.vscode-paste-image"
vscode "naumovs.color-highlight"
vscode "orangex4.vscode-smart-ime"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "remisa.shellman"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.text-marker"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "sdras.night-owl"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "tabnine.tabnine-vscode"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tootone.org-mode"
vscode "usernamehw.todo-md"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wallabyjs.quokka-vscode"
vscode "wesbos.theme-cobalt2"
vscode "xabikos.javascriptsnippets"
vscode "xadillax.viml"
vscode "yzhang.markdown-all-in-one"
vscode "zaaack.markdown-editor"
vscode "zixuanwang.linkerscript"
